---
kind: type
id: T:Autodesk.Revit.DB.Fabrication.FabricationPartSizeMap
source: html/b4be4ccc-ac6d-bb65-ef61-a41713b2916f.htm
---
# Autodesk.Revit.DB.Fabrication.FabricationPartSizeMap

This class represents the fabrication part size map for straights allowing the sizes to be changed from a user interface for multiple straights with diffent sizes.

## Syntax (C#)
```csharp
public class FabricationPartSizeMap : IDisposable
```

## Remarks
This is used as the data container for the FabricationPartSizeMapSet typeDef for crs:Set or Autodesk.Revit.DB.Fabrication.FabricationPartSizeMap for ISet so a list of sizes can be generated to allow the user to select a size and map it to another.